'''
2. Во втором массиве сохранить индексы четных элементов первого массива.
Например, если дан массив со значениями 8, 3, 15, 6, 4, 2, то во второй массив
надо заполнить значениями 1, 4, 5, 6 (или 0, 3, 4, 5 – если индексация начинается с нуля),
т.к. именно в этих позициях первого массива стоят четные числа.
'''

import random
NUM_LIST = [10, 99]
NUM_ITEMS = [5, 10]

list1 = [random.randint(*NUM_LIST) for _ in range(random.randint(*NUM_ITEMS))]
list2 = []
txt = '         '
for i in range(len(list1)):
    if list1[i] % 2 == 0:
        list2.append(i)
        txt += f'  {i} '
    else:
        txt += f'    '

if list2 == []:
    print(f'В списке {list1} нет четных элементов')
else:
    print(f'В списке {list1} четные элементы располагаются под индексами {list2}')
    print(txt)




